/*###04.04_Java语言基础(循环结构for语句的练习之水仙花)
* A:案例演示
	* 需求：在控制台输出所有的”水仙花数”

	* 所谓的水仙花数是指一个三位数，其各位数字的立方和等于该数本身。
	* 举例：153就是一个水仙花数。
	* 153 = 1*1*1 + 5*5*5 + 3*3*3 = 1 + 125 + 27 = 153*/
class Forxt3{
	public static void main(String[] args){
		
	//for (int a =100;a <=999 ;a++ ){	//此行能得出100到999的所以三位数
	//	int ge =  a % 10;			//此行能求出三位数的个十百的值,因为三位数都是十进制的百位数就除两次十,就相当于百位数除以100,余数再%10就是本身了,
	//	int shi = a / 10 % 10;		//因为十进制是1到9,%摸鱼10比10小,余数还是本身,十位数除一次十,再%10,取余,个位数就直接%10就能得到	
	//	int bai = a / 10 / 10 % 10;  
	//if (a == ge * ge * ge + shi * shi * shi + bai * bai * bai){			//此行能找出符合.三位数,各位数字的立方和等于数字本身的数
	//	System.out.println(a);	//输出结果153 370 371 407	注意此行输出语句是if的输出语句,要在if后的大括号里才有效
	//}
	//}
	
/*
###04.05_Java语言基础(循环结构for语句的练习之统计思想)
* A:案例演示
	* 需求：统计”水仙花数”共有多少个	(计算器思想)*/	
		/*int b = 0;	//设置b位水仙花的个数
		for (int a = 100;a <= 999 ;a++ ){												
		int ge =  a % 10;																
		int shi = a / 10 % 10;																	
		int bai = a / 10 / 10 % 10;  
	if (a == ge * ge * ge + shi * shi * shi + bai * bai * bai){		
		b++;    //此行意思是把100到999所有满足条件的,都依次循环给b 满足条件就自增,这就叫计算器思想
	}
	}
	System.out.println(b);	//输出结果位 4*/
	}
}